In [6]:
# EDA
# 파일 여러개 가져와서 합칠 줄 알아야 한다. (데이타 병합)
# res1= np.array([
# [ 1,'홍일동',166,59,19 ,'남'],
# [ 2,'홍이동',168,600,19,'여'],
# [ 3,'홍삼동',170,33,19 ,'남'],
# [ 4,'홍사동',172,32,19 ,'여'],
# [ 5,'홍오동',174,30,19 ,'남']])

import numpy as np
from scipy import linalg
import pandas as pd

In [7]:

dic1 = {
    'a' : 95,
    'b' : 92,
    'c' : 98,
    'd' : 100    
}
dic2 = {
    'a' : 91,
    'b': 93,
    'c':97,
    'd': 99    
}
ser1= pd.Series(dic1)
df_1 = pd.DataFrame(ser1)
df_1.columns = ["A반"]
df_1["B반"] = dic2
df_1

    A반  B반
a   95  91
b   92  93
c   98  97
d  100  99

In [8]:
arr1= np.array([
    [95	,91],
    [92	,93],
    [98	,97],
    [100 ,99]
])
df1 = pd.DataFrame(data=arr1, columns=['A반','B반'])

In [9]:
arr1.ndim

2

In [10]:
arr1.shape

(4, 2)

In [11]:
arr1.size

8

In [12]:
arr1.dtype

dtype('int32')

In [13]:
df1

    A반  B반
0   95  91
1   92  93
2   98  97
3  100  99

In [14]:
df1.iloc[0]
df1.iloc[0]['A반']

95

In [15]:
df1.iloc[0]

A반    95
B반    91
Name: 0, dtype: int32

In [16]:
df1['A반']

0     95
1     92
2     98
3    100
Name: A반, dtype: int32

In [17]:
arr2 = np.array([
    [87	,85],
    [89	,90]
]) 
df2 = pd.DataFrame(data=arr2, columns=['A반','B반'])
df2

   A반  B반
0  87  85
1  89  90

In [18]:
arr3 = np.array([
    [100],
    [100],
    [100],
    [100]
]) 
df4 = pd.DataFrame(data=arr3, columns=['D반'])

In [19]:
df1.join(df4)

    A반  B반   D반
0   95  91  100
1   92  93  100
2   98  97  100
3  100  99  100

In [20]:
# 데이터를 하나로 합치기 (밑에다가, 리스트형태로 되어야 한다.)
df_res = pd.concat([df1, df2], ignore_index=True)
df_res

    A반  B반
0   95  91
1   92  93
2   98  97
3  100  99
4   87  85
5   89  90

In [21]:
df_res.transpose()

     0   1   2    3   4   5
A반  95  92  98  100  87  89
B반  91  93  97   99  85  90

In [22]:
# 표 만드는 일반적인 방법1

In [23]:
data1 = {
    'id' : ['hong1','hong2','hong3','hong4','hong5'],
    '이름': ['홍일동','홍이동','홍삼동','홍사동','홍오동'],
    '키' : [166,168,170,172,174]
}
pd.DataFrame(data1)

      id   이름    키
0  hong1  홍일동  166
1  hong2  홍이동  168
2  hong3  홍삼동  170
3  hong4  홍사동  172
4  hong5  홍오동  174

In [24]:
# 표 만드는 일반적인 방법2

In [25]:
idx =['hong1','hong2','hong3','hong4','hong5']
data2 = {        
    '이름': ['홍일동','홍이동','홍삼동','홍사동','홍오동'],
    '키' : [166,168,170,172,174]   
}
pd.DataFrame(data2, index=pd.Index((idx), name="student"))

          이름    키
student
hong1    홍일동  166
hong2    홍이동  168
hong3    홍삼동  170
hong4    홍사동  172
hong5    홍오동  174

In [26]:
pd_stu = pd.DataFrame(data2, index=pd.Index((idx), name="student"))
#pd_stu.index
pd_stu

          이름    키
student
hong1    홍일동  166
hong2    홍이동  168
hong3    홍삼동  170
hong4    홍사동  172
hong5    홍오동  174

In [27]:
pd_stu.loc['hong4']

이름    홍사동
키     172
Name: hong4, dtype: object

In [28]:
df1_stu =  pd.DataFrame(data1)
df1_stu.index

RangeIndex(start=0, stop=5, step=1)

In [29]:
df1_stu.set_index('id', inplace=True)

In [30]:
df1_stu

        이름    키
id
hong1  홍일동  166
hong2  홍이동  168
hong3  홍삼동  170
hong4  홍사동  172
hong5  홍오동  174

In [31]:
df1_stu['hong2']

KeyError: 'hong2'